package kr.ac.kopo.day02.homework;

/*
 * [1번]
 * 2개의 정수를 입력받아 다음과 같이 출력하는 코드를 작성
 * 
 * [1번 출력값]
 * 첫번째 정수 : 12
 * 두번째 정수 : 5
 * 
 * 12 + 5 = 17
 * 12 - 5 = 7
 * 12 * 5 = 60
 * 12 / 5 = 2.40 //소수점 둘째자리가지 출력
 * 12 % 5 = 2
 * 
 * 
 * [2번]
 * 반지름을 입력받아 원둘레와 원넓이를 출력하는 코드를 작성
 * 단, 원주율을 상수변수를 사용해서 작성
 * 
 * [2번 출력값]
 * 반지름을 입력 : 1
 * 반지름이 1일때, 원 둘레는 xxxx이고, 원 넓이는 xxxx이다.
 * 
 * [3번]
 * 2960원어치 물건을 사고 5000원을 입력했을 때 
 * 거스름돈의 액수와 1000, 500, 100, 50, 10원의 개수를 출력하는 코드를 작성
 * 만약, 물건값보다 지불한 액수가 적을 때 "xxxx원이 부족합니다."를 출력 
 * 
 * [3번 출력값]
 * 물건값을 입력 : 2960
 * 지불한 액수를 입력 : 5000
 * 
 * 거스름돈 : 2040원
 * 1000원 : 2개
 * 500원 : 0개 
 * 100원 : 0개 
 * 50원 : 0개
 * 10원 : 4개
 * 
 * or
 * 
 * 물건값을 입력 : 2960
 * 지불한 액수를 입력 : 5000
 * 
 * 거스름돈 : 2040원
 * 1000원 : 2개
 * 10원 : 4개
 * 
 * [4번]
 * 두 개의 정수를 입력받아 첫번째 정수가 두번째 정수의 배수인지 판단하는 프로그램을 작성
 * 조건연산자를 이용한 버전과 if문을 이용한 버전 총 2가지를 만들 것
 * 
 * [4번 출력값]
 * 첫번째 정수 입력 : 12
 * 두번째 정수 입력 : 4
 * 
 * 12가 4의 배수인지 판단결과 : true //true가 아니라 한글로 '참'이 나오도록 출력해볼 것  
 */

public class HomeworkMarch09 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
